/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lines_count.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: lyahasik <lyahasik@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/14 14:11:19 by lyahasik          #+#    #+#             */
/*   Updated: 2020/11/14 14:11:57 by lyahasik         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Подсчет количества строк в двумерном массиве
*/

int	ft_lines_count(char **lines)
{
	int	i;

	if (!lines)
		return (0);
	i = 0;
	while (lines[i])
		i++;
	return (i);
}
