/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_mem_free_two.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: lyahasik <lyahasik@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/30 23:02:50 by lyahasik          #+#    #+#             */
/*   Updated: 2020/11/04 15:17:22 by lyahasik         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Освобождение двумерного указателя.
** input_1 двумерный указатель.
** return 0.
*/

int	ft_mem_free_two(void **value)
{
	int	i;

	if (!value)
		return (0);
	i = -1;
	while (value[++i])
	{
		free(value[i]);
	}
	free(value);
	return (0);
}
