/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_out_message.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: lyahasik <lyahasik@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/30 23:17:36 by lyahasik          #+#    #+#             */
/*   Updated: 2020/10/30 23:17:45 by lyahasik         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Вывод сообщения.
** input_1 строка.
** input_2 значение которое следует вернуть.
** return returned.
*/

int	ft_out_message(char *str, int returned)
{
	ft_putstr(str);
	return (returned);
}
